Documents/ПоступлениеТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровИУслуг</Name>
			<Comment>Поступление товаров и услуг</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ОтгрузкиСПроизодстваДляРозницы</xr:Item>
				<xr:Item>AccumulationRegister.Закупки</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРозницыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ПоступленияДляРозницыОтПроизодства</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеЗаказовРозницы</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРозницыВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресМонтажа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРозничногоДоговора</Name>
					<Comment>#7381</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОтПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОтПроизводстваПоРучнымЗаказам</Name>
					<Comment>#7381</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеОтПроизводстваУИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРаспределенияСтоимостиДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СвязкиОрганизацийПроизводстваКонтрагентРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязкиОрганизацийПроизводстваКонтрагентРозницы</Name>
			<Comment>#7381</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОрганизацияПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьАдресМонтажаВШапкеДокумента</Name>
					<Comment>#7805</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеТоваровИУслуг/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) 
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")
				И ДанныеЗаполнения.Свойство("ТолькоМатериалы") Тогда
				ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения.Основание, ДанныеЗаполнения.ТолькоМатериалы);
			КонецЕсли;
		КонецЕсли;		
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		// Заполнение шапки
		
		ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		
		// реквизиты ПоступлениеОтПроизводства и ПоступлениеОтПроизводстваПоРучнымЗаказам заполняются в общем модуле в процедуре СозданиеПоступленийПоРеализациямОтПроизводства
		// далее идет вызов Заполнить()
		
		Валюта = ДанныеЗаполнения.Валюта;
		ВхДата = ДанныеЗаполнения.Дата;
		ВхНомер = ДанныеЗаполнения.Номер;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		НомерРозничногоДоговора	= ДанныеЗаполнения.НомерРозничногоДоговора; //#7381
		АдресМонтажа = ДанныеЗаполнения.АдресМонтажа; //#10837
		
		//#10239 для случая ручного создания Поступления из Реализации, а не по регламенту и не из АРМ
		Если НЕ ПоступлениеОтПроизводства Тогда 
			ПоступлениеОтПроизводства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуПоИнтеркампани");
		КонецЕсли;
		Если НЕ ПоступлениеОтПроизводстваПоРучнымЗаказам Тогда 
			ПоступлениеОтПроизводстваПоРучнымЗаказам = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуСозданныхВручную");
		КонецЕсли;
		
		//Если документ создается на основании РТиУ, которое было создано на основании ЗаказаПокупателя с заполненной настройкой интеркампани
		Если ПоступлениеОтПроизводства Тогда // ПоступлениеОтПроизводства = Реализация.АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуПоИнтеркампани
			Если НЕ ДанныеЗаполнения.НастройкаИнтеркампани.Пустая() Тогда
				Организация = Справочники.Организации.ПолучитьОрганизациюПоКонтрагенту(ДанныеЗаполнения.Контрагент, ДанныеЗаполнения.НастройкаИнтеркампани);
				Контрагент  = Справочники.Организации.ПолучитьКонтрагентаПоОрганизации(ДанныеЗаполнения.Организация, ДанныеЗаполнения.НастройкаИнтеркампани);
				Склад 		= Справочники.НастройкиИнтеркампани.ПолучитьСкладРозницыПриПоступленииТоваров(ДанныеЗаполнения.НастройкаИнтеркампани); //#7764
			Иначе
				Организация = Справочники.Организации.ПолучитьОрганизациюПоКонтрагенту(ДанныеЗаполнения.Контрагент, Неопределено);
				Контрагент  = Справочники.Организации.ПолучитьКонтрагентаПоОрганизации(ДанныеЗаполнения.Организация, Неопределено);
			КонецЕсли;
		КонецЕсли;
		
		Если ПоступлениеОтПроизводстваПоРучнымЗаказам Тогда // ПоступлениеОтПроизводстваПоРучнымЗаказам = Реализация.АвтоматическиСоздатьДокументПоступленияОтПроизводстваНаРозницуСозданныхВручную
			
			//++ №7764 комментируем, возвращаем ранее имеющуюся логику
			//Организация = ДанныеЗаполнения.ОрганизацияПоступления;
			//Контрагент = ДанныеЗаполнения.КонтрагентПоступления;
			//Склад = ДанныеЗаполнения.СкладПоступления; 
			//#7764
			
			МенеджерЗаписи = РегистрыСведений.СвязкиОрганизацийПроизводстваКонтрагентРозницы.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Организация = ДанныеЗаполнения.Организация;
			МенеджерЗаписи.Контрагент  = ДанныеЗаполнения.Контрагент;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				Организация = МенеджерЗаписи.ОрганизацияПоступления;
				Контрагент  = МенеджерЗаписи.КонтрагентПоступления;
				Склад  		= МенеджерЗаписи.СкладПоступления;
			КонецЕсли;
			
		КонецЕсли;
		
		ДоговорКонтрагента = Контрагент.ОсновнойДоговор;
		
		Если НЕ ПоступлениеОтПроизводства И НЕ ПоступлениеОтПроизводстваПоРучнымЗаказам Тогда
			ЗаполнитьТаблицыТоваровИУслугПоОснованию(ДанныеЗаполнения.Товары, ДанныеЗаполнения.Услуги, ДанныеЗаполнения);
		Иначе
			ЗаполнитьТаблицыТоваровИУслугПоИнтеркампани(ДанныеЗаполнения);			
		КонецЕсли;
		
		СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		
		ЗаполнитьПоЗаказДоговоруМонтажу(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		
		ЗаполнитьПоЗаказДоговоруМонтажу(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Основание 			= ДанныеЗаполнения;
		Организация 		= ДанныеЗаполнения.Организация;
		Подразделение 		= ДанныеЗаполнения.Подразделение;
		Контрагент 			= ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента 	= ДанныеЗаполнения.ДоговорКонтрагента;
		ВидЦеныПоставщика 	= ДанныеЗаполнения.ВидЦеныПоставщика;
		Валюта 				= ДанныеЗаполнения.Валюта;
		Склад				= ДанныеЗаполнения.Склад; // №11352
		
		СтруктураПоискаСтроки = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Цена");
		//получим перечень товаров, которые еще не оприходованы по заказу
		НеполученныеТовары = РегистрыНакопления.ЗаказыПоставщикам.ПолучитьТоварыКСписанию(ТекущаяДатаСеанса(), ДанныеЗаполнения.Ссылка, Организация, ДанныеЗаполнения.Товары, Ссылка);
		Для Каждого ТекущаяСтрока Из НеполученныеТовары Цикл
			ЭтоУслуги = Ложь;
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
				НоваяСтрока = Услуги.Добавить();
				ЭтоУслуги = Истина;
			Иначе
				НоваяСтрока = Товары.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			//НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена; //#8742
			Если НоваяСтрока.Коэффициент = 0 Тогда				
				Сообщить("В документе-основании у номенклатуры " + НоваяСтрока.Номенклатура + " не указан коэффициент. Расчетное количество к поступлению может быть не верным!");
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоискаСтроки, ТекущаяСтрока);
			НайденныеСтроки = ДанныеЗаполнения.Товары.НайтиСтроки(СтруктураПоискаСтроки);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НоваяСтрока.СтавкаНДС = НайденныеСтроки[0].СтавкаНДС;
				ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, Истина);
			КонецЕсли;

		КонецЦикла;
		
		СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		
		ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);
		
		ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Основание = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение; //#5775
		АдресМонтажа = ДанныеЗаполнения.АдресМонтажа; //#10837
		
		Для Каждого ТекущаяСтрокаТоварыОснования Из ДанныеЗаполнения.Товары Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрокаТоварыОснования.Номенклатура) Тогда
				НоваяСтрока = Услуги.Добавить();			
			Иначе
				НоваяСтрока = Товары.Добавить();				
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрокаТоварыОснования,,"Сумма");				
			Если НоваяСтрока.Количество > 0 Тогда
				НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
			КонецЕсли;
		КонецЦикла;
		
		СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда	
		
		Основание = ДанныеЗаполнения.Ссылка;
		Организация = Основание.Организация;
		Контрагент = Основание.Экспедитор;
		ДоговорКонтрагента = Контрагент.ОсновнойДоговор;
		Валюта = Основание.Валюта;
		
		НоваяСтрока = Услуги.Добавить();
		НоваяСтрока.Номенклатура = Константы.НоменклатураДоставки.Получить();
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = Основание.СтоимостьДоставки;
		НоваяСтрока.Сумма = Основание.СтоимостьДоставки;
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = 1;
		
		СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
		
	КонецЕсли;
	
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, , Ложь);
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") И НЕ Основание.Пустая() Тогда
		//Всё ок, проверяемые реквизиты комната и назначение оставляем
		
		//#4679
		Если ПолучитьФункциональнуюОпцию("КоличествоТоваровКСписаниюВРозницеНеСоответствуетКоличествуПроданногоТовара") Тогда
			РеквизитКоличество = ПроверяемыеРеквизиты.Найти("Товары.Количество");
			Если НЕ РеквизитКоличество = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(РеквизитКоличество);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам И ПроверяемыеРеквизиты.Найти("Товары.Комната") <> Неопределено Тогда			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Комната"));
		КонецЕсли;
		
	Иначе
		Если ПроверяемыеРеквизиты.Найти("Товары.Комната") <> Неопределено Тогда			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Комната"));
		КонецЕсли;
		Если ПроверяемыеРеквизиты.Найти("Товары.Назначение") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Назначение"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);
	
	Документы.ЗаказДоговор.ПроверитьКомнатыПоЗаказу(ЭтотОбъект, Отказ, РежимЗаписи);
	
	// №12269
	Документы.ПоступлениеТоваровИУслуг.ПроверитьКоличествоИПлощадьПотолка(ЭтотОбъект, Отказ, РежимЗаписи);
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	//приход на склад
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого Товар Из Товары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Ссылка.Дата;
		Движение.Организация = ОрганизацияТоваров;
		Движение.Склад = Склад;
		Движение.Номенклатура = Товар.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Движение.Количество = Товар.Количество * Товар.Коэффициент;
		//Если не Товары.Количество() = 0 Тогда
		//	Коэффициент = 1 / Товары.Количество();
		//Иначе
		//	Коэффициент = 1;
		//КонецЕсли;
		//Если НЕ Товары.Итог("Сумма") = 0 Тогда
		//	Коэффициент = Товар.Сумма / Товары.Итог("Сумма");
		//КонецЕсли;
		СуммаСебестоимостиСУчетомДоставки = ПолучитьСуммуСУчетомДоставки(Товар); //Товар.Сумма + Окр(СтоимостьДоставки * Коэффициент,2); 
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаСебестоимостиСУчетомДоставки);
		Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, СуммаСебестоимостиСУчетомДоставки); //#8288 
	КонецЦикла;
	
	Для Каждого Товар Из Услуги Цикл
		Если НЕ Товар.Потолок.Пустая() Тогда
			Движение = Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Ссылка.Дата;
			Движение.Организация = ОрганизацияТоваров;
			Движение.Склад = Склад;
			Движение.Номенклатура = Товар.Потолок;
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма);
			Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Товар.Сумма); //#8288
		КонецЕсли;
	КонецЦикла;
	
	//запись взаиморасчетов
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Ссылка.Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ДоговорКонтрагента;
	//Движение.Документ = Ссылка;
	Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаДокумента);
	Движение.Организация = Организация;
	
	//Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	Движение.ВидДвижения =ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ДоговорКонтрагента;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаДокумента;
		
	
	//заказы поставщикам
	//Движения.ЗаказыПоставщикам.Записывать = Истина;
	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
		ТаблицаТоваровКСписанию = Товары.Выгрузить();
		Если НЕ РегистрыНакопления.ЗаказыПоставщикам.КонтрольОстатков(Ссылка, Основание, ТаблицаТоваровКСписанию) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		ТаблицаУслугКСписанию = Услуги.Выгрузить();
		Если НЕ РегистрыНакопления.ЗаказыПоставщикам.КонтрольОстатков(Ссылка,Основание, ТаблицаУслугКСписанию) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаУслугКСписанию, ТаблицаТоваровКСписанию);
		Движения.ЗаказыПоставщикам.ВыполнитьРасход(Ссылка, Дата, Основание, Организация, ТаблицаТоваровКСписанию, Отказ); //делаем именно так, чтобы отрабатывало ОжидаемыеПоставки_Рассчитать
		
		//Для Каждого Товар Из ТаблицаТоваровКСписанию Цикл
		//	Движение = Движения.ЗаказыПоставщикам.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//	Движение.Период = Дата;
		//	Движение.ЗаказПоставщику = Основание;
		//	Движение.Организация = Организация;
		//	Движение.Номенклатура = Товар.Номенклатура;
		//	Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры; // #11666
		//	Движение.Количество = Товар.Количество * Товар.Коэффициент;
		//	Движение.Потолок = Товар.Потолок;
		//	Движение.Цена = Товар.Цена;
		//	Движение.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
		//	Движение.Сумма = Товар.Сумма; //#8742
		//КонецЦикла;
		//
		//Для Каждого Товар Из ТаблицаУслугКСписанию Цикл
		//	Движение = Движения.ЗаказыПоставщикам.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//	Движение.Период = Дата;
		//	Движение.ЗаказПоставщику = Основание;
		//	Движение.Организация = Организация;
		//	Движение.Номенклатура = Товар.Номенклатура;
		//	Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры; // #11666
		//	Движение.Количество = Товар.Количество * Товар.Коэффициент;
		//	Движение.Потолок = Товар.Потолок;
		//	Движение.Цена = Товар.Цена;
		//	Движение.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
		//	Движение.Сумма = Товар.Сумма; //#8742
		//КонецЦикла;
		
	КонецЕсли;
	
	ВалютаУчета = ПолучитьФункциональнуюОпцию("ВалютаУчета"); //Константы.ВалютаУчета.Получить();
	
	//закупки		
	Движения.Закупки.Записывать = Истина;	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Движение = Движения.Закупки.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		//Если не Товары.Количество() = 0 Тогда
		//	Коэффициент = 1 / Товары.Количество();
		//Иначе
		//	Коэффициент = 1;
		//КонецЕсли;
		//Если НЕ Товары.Итог("Сумма") = 0 Тогда
		//	Коэффициент = ТекущаяСтрока.Сумма / Товары.Итог("Сумма");
		//КонецЕсли;
		//СуммаСебестоимостиСУчетомДоставки = ТекущаяСтрока.Сумма + Окр(СтоимостьДоставки * Коэффициент,2);
		СуммаСебестоимостиСУчетомДоставки = ПолучитьСуммуСУчетомДоставки(ТекущаяСтрока);
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаСебестоимостиСУчетомДоставки); //РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ВалютаУчета, Дата, СуммаСебестоимостиСУчетомДоставки);
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из Услуги Цикл
		Движение = Движения.Закупки.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма); //РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ВалютаУчета, Дата, ТекущаяСтрока.Сумма);
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры; // №8956
	КонецЦикла;
	
	//Отгрузки с произодства для розницы
	Движения.ОтгрузкиСПроизодстваДляРозницы.Записывать = Истина;
	Движения.ПоступленияДляРозницыОтПроизодства.Записывать = Истина;
	
	ТоварыСвернуто = Товары.Выгрузить();
	Для каждого СтрокаТЗ из ТоварыСвернуто Цикл
		Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;	
	КонецЦикла;
	ТоварыСвернуто.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", "Количество");
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") И ЗначениеЗаполнено(Основание) Тогда
		Если ПоступлениеОтПроизводства Тогда			
			Движение = Движения.ОтгрузкиСПроизодстваДляРозницы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Реализация = Основание;
			Движение.Оприходовать = 1;
			
			//#10822
			Если НЕ ПустаяСтрока(НомерРозничногоДоговора) Тогда
				Для Каждого ТекущаяСтрока Из ТоварыСвернуто Цикл
					Движение = Движения.ПоступленияДляРозницыОтПроизодства.Добавить();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.НомерРозничногоДоговора = НомерРозничногоДоговора;				
					Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
					Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
					Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;				
					Движение.Количество = ТекущаяСтрока.Количество;
				КонецЦикла;
			КонецЕсли;
	
		//#7381	
		ИначеЕсли ПоступлениеОтПроизводстваПоРучнымЗаказам Тогда
			Движение = Движения.ОтгрузкиСПроизодстваДляРозницы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Реализация = Основание;
			Движение.ОприходоватьПоРучнымЗаказам = 1;
			
			//#10822
			Если НЕ ПустаяСтрока(НомерРозничногоДоговора) Тогда
				Для Каждого ТекущаяСтрока Из ТоварыСвернуто Цикл
					Движение = Движения.ПоступленияДляРозницыОтПроизодства.Добавить();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.НомерРозничногоДоговора = НомерРозничногоДоговора;				
					Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
					Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
					Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;				
					Движение.Количество = ТекущаяСтрока.Количество;
				КонецЦикла;
			КонецЕсли;
		
		КонецЕсли;
	КонецЕсли;
	
	//заказы розницы в производстве
	Если ПоступлениеОтПроизводства Тогда
		Движения.ЗаказыРозницыВПроизводстве.Записывать = Истина;
		Если НЕ Основание = Неопределено Тогда
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
				ЗаказНаПроизводство = Основание.Основание;
				Если НЕ ЗаказНаПроизводство = Неопределено Тогда
					Если ТипЗнч(ЗаказНаПроизводство) = ТИп("ДокументСсылка.ЗаказНаПроизводство") Тогда
						ДокументОснование = ЗаказНаПроизводство.ДокументОснование;
						Если НЕ ДокументОснование = Неопределено Тогда
							Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
								Движение = Движения.ЗаказыРозницыВПроизводстве.Добавить();
								Движение.ЗаказДоговор = ДокументОснование;
								Движение.Период = Дата;
								Движение.Получен = 1;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//заказы розницы поставщикам
	Если ЗначениеЗаполнено(Основание) Тогда
		//через заказ поставщику
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Если ЗначениеЗаполнено(Основание.Основание) 
				И (ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.ЗаказДоговор")
				   ИЛИ ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.Монтаж")) Тогда
				Движения.ЗаказыРозницыПоставщикам.Записывать = Истина;											
				Для Каждого ТекущаяСтрока Из Товары Цикл
					Движение = Движения.ЗаказыРозницыПоставщикам.Добавить();
					Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
					Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
					Движение.Получен = ТекущаяСтрока.Количество;
					Движение.ЗаказДоговор = Основание.Основание;
					Движение.Период = Дата;
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
		//через заказ-договор / монтаж
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") 
			ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.Монтаж") Тогда
			Движения.ЗаказыРозницыПоставщикам.Записывать = Истина;
			Если НЕ Основание.Пустая() Тогда
				Для Каждого ТекущаяСтрока Из Товары Цикл
					Движение = Движения.ЗаказыРозницыПоставщикам.Добавить();
					Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
					Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
					Движение.Получен = ТекущаяСтрока.Количество;
					Движение.ЗаказДоговор = Основание;
					Движение.Период = Дата;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		//некассовый метод
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяРасходов.Пустая(), ТекущаяСтрока.СтатьяРасходов, СтатьяРасходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);				
			КонецЦикла;
			
			Для Каждого ТекущаяСтрока Из Услуги Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяРасходов.Пустая(), ТекущаяСтрока.СтатьяРасходов, СтатьяРасходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;				
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);				
			КонецЦикла;
			
			Если СтоимостьДоставки > 0 Тогда
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= СтатьяРасходов;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СтоимостьДоставки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	//регистр Обеспечение заказов Розница
	Если РегистрыНакопления.ОбеспечениеЗаказовРозницы.ТребуетсяЗаписьПоОснованию(Основание) Тогда		
		Движения.ОбеспечениеЗаказовРозницы.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из Товары Цикл
			Если (НЕ ЗначениеЗаполнено(ТекущаяСтрока.Комната) И СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам)
				ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Назначение)
				ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда 
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ОбеспечениеЗаказовРозницы.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Заказ 			= Основание;
			Движение.Период 		= Дата;			
			Движение.Номенклатура 	= ТекущаяСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры 	= ТекущаяСтрока.ХарактеристикаНоменклатуры;
			Движение.Комната 		= ТекущаяСтрока.Комната;
			Движение.Назначение 	= ТекущаяСтрока.Назначение;
			Движение.Количество 	= ТекущаяСтрока.Количество;
			Движение.КоличествоПоФакту = ТекущаяСтрока.Количество;
			//#4679
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда 
				Движение.Количество = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//#16643
	Если ЗначениеЗаполнено(Основание) 
		И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда		
		//#16643
		ОбщийМодульСервер.ОжидаемыеПоставки_Рассчитать(Основание);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.ЗаказыПоставщикам.ОчиститьДвижения(Ссылка, Отказ); // нужно для ОжидаемыеПоставки_УдалитьЗаписиПоЗаказу
	
	//#16643
	Если ЗначениеЗаполнено(Основание) 
		И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда		
		//#16643
		ОбщийМодульСервер.ОжидаемыеПоставки_Рассчитать(Основание);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14675
	СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам = Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить();
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения, ТолькоМатериалы = Ложь)
	
	Документы.ЗаказНаПроизводство.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);

	Валюта 			= ДанныеЗаполнения.Валюта;
	Основание 		= ДанныеЗаполнения.Ссылка;		
	Организация 	= ДанныеЗаполнения.Организация;
		
	Если НЕ ТолькоМатериалы Тогда
		ЗаполнитьТаблицыТоваровИУслугПоОснованию(ДанныеЗаполнения.Товары, ДанныеЗаполнения.Услуги, ДанныеЗаполнения);	
	Иначе	
		
		Для Каждого ТекСтрокаОснования Из ДанныеЗаполнения.Материалы Цикл
			// #13705 убрана проверка на Вид номенклатуры
			//Если ТекСтрокаОснования.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования);
			//КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказДоговоруМонтажу(ДанныеЗаполнения)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
	Основание 	= ДанныеЗаполнения;
	Организация = ДанныеЗаполнения.Организация;
	Валюта 		= ДанныеЗаполнения.Валюта;
	
	ДобавлятьТовары 	= Константы.ЗаказПоставщикуЗаказыватьТовары.Получить();
	ДобавлятьМатериалы 	= Константы.ЗаказПоставщикуЗаказыватьМатериалы.Получить();
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	РегистрыНакопления.ОбеспечениеЗаказовРозницы.ПолучитьОстаткиКОбеспечению(МенеджерВТ, ДанныеЗаполнения, Ссылка, СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Комната КАК Комната,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Товары.Коэффициент КАК Коэффициент,
	|	ВТ_Товары.Назначение КАК Назначение,
	|	ВТ_Товары.НомерПотолка КАК НомерПотолка,
	|	ВТ_Товары.КоличествоКОбеспечению КАК Количество
	|ИЗ
	|	ВТ_ТоварыКОбеспечениюСвернуто КАК ВТ_Товары
	|ГДЕ
	|	ВТ_Товары.КоличествоКОбеспечению > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Материалы.Комната КАК Комната,
	|	ВТ_Материалы.Номенклатура КАК Номенклатура,
	|	ВТ_Материалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Материалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Материалы.Коэффициент КАК Коэффициент,
	|	ВТ_Материалы.Назначение КАК Назначение,
	|	ВТ_Материалы.КоличествоКОбеспечению КАК Количество
	|ИЗ
	|	ВТ_МатериалыКОбеспечениюСвернуто КАК ВТ_Материалы
	|ГДЕ
	|	ВТ_Материалы.КоличествоКОбеспечению > 0";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаТоваров = РезультатЗапроса[0].Выбрать();
	ВыборкаМатериалов = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаТоваров.Следующий()  Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ВыборкаТоваров.Номенклатура) Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТоваров);
			//#4679
			Если ПолучитьФункциональнуюОпцию("КоличествоТоваровКСписаниюВРозницеНеСоответствуетКоличествуПроданногоТовара") Тогда
				НоваяСтрока.Количество = НоваяСтрока.Номенклатура.Потолок_КоличествоПродукция;
			КонецЕсли;
		ИначеЕсли ВыборкаТоваров.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал и ДобавлятьТовары Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТоваров);
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") И НЕ ПустаяСтрока(ВыборкаТоваров.НомерПотолка) Тогда
				НоваяСтрока.Потолок = Документы.ЗаказДоговор.ПолучитьПотолокОснованияПоНомеру(ДанныеЗаполнения.ТоварыУслуги, ВыборкаТоваров.НомерПотолка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ДобавлятьМатериалы Тогда
		Пока ВыборкаМатериалов.Следующий() Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаМатериалов);
			//НоваяСтрока.Назначение = "Материалы";
		КонецЦикла;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыТоваровИУслугПоОснованию(ОснованиеТовары, ОснованиеУслуги, Основание = Неопределено)
	Для Каждого ТекСтрокаТовары Из ОснованиеТовары Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
		НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
		НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
		НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
		НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда 
			НоваяСтрока.Потолок = ?(Основание.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка, Основание.ПродукцияНоменклатура, Справочники.Номенклатура.ПустаяСсылка());		
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			НоваяСтрока.Потолок = ТекСтрокаТовары.Потолок;
		ИначеЕсли ТипЗнч(Основание) = Тип("Структура") И Основание.Свойство("УИБ") Тогда
			НоваяСтрока.Потолок = ТекСтрокаТовары.Потолок;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрокаУслуги Из ОснованиеУслуги Цикл
		НоваяСтрока = Услуги.Добавить();
		НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаУслуги.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
		НоваяСтрока.Коэффициент = ТекСтрокаУслуги.Коэффициент;
		НоваяСтрока.Номенклатура = ТекСтрокаУслуги.Номенклатура;
		НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
		НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда 
			НоваяСтрока.Потолок = ?(Основание.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка, Основание.ПродукцияНоменклатура, Справочники.Номенклатура.ПустаяСсылка());
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			НоваяСтрока.Потолок = ТекСтрокаУслуги.Потолок;
		ИначеЕсли ТипЗнч(Основание) = Тип("Структура") И Основание.Свойство("УИБ") Тогда
			НоваяСтрока.Потолок = ТекСтрокаУслуги.Потолок;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьТаблицыТоваровИУслугПоИнтеркампани(ДанныеЗаполнения) Экспорт
	//проверяем, нужно ли стоимость услуг отнести на потолок
	Если НЕ Константы.СтоимостьПотолкаВключаетУслугиРаскрояПриПокупкеДляРозницы.Получить() Тогда
		ЗаполнитьТаблицыТоваровИУслугПоОснованию(ДанныеЗаполнения.Товары, ДанныеЗаполнения.Услуги, ДанныеЗаполнения);
	Иначе
		
		СуммаУслугОснования = ДанныеЗаполнения.Услуги.Итог("Сумма");
		//получим общее количество потолков в документе-основании
		КоличествоПотолковВсего = 0;
		Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
				КоличествоПотолковВсего = КоличествоПотолковВсего + ТекущаяСтрока.Количество;
			КонецЕсли;
		КонецЦИкла;
		
		ВсегоРаспределено = 0;
		НомерСтрокиПоследнегоПотолка = 0;
		Если КоличествоПотолковВсего > 0 Тогда
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
				НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
				НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
				НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
				НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
				//добавим стоимость услуг, если это потолок
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(НоваяСтрока.Номенклатура) Тогда
					НомерСтрокиПоследнегоПотолка = НоваяСтрока.НомерСтроки;
					Если СуммаУслугОснования > 0 Тогда
						СуммаКРаспределению = Окр(СуммаУслугОснования * (НоваяСтрока.Количество / КоличествоПотолковВсего),2);
					Иначе
						СуммаКРаспределению = 0;
					КонецЕсли;	
					НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма + СуммаКРаспределению;
					ВсегоРаспределено = ВсегоРаспределено + СуммаКРаспределению;
					Если НЕ НоваяСтрока.Количество = 0 Тогда
						НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
					Иначе
						НоваяСтрока.Цена = НоваяСтрока.Сумма;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если НЕ НомерСтрокиПоследнегоПотолка = 0 Тогда
				//распределим хвостик от суммы
				СуммаКРаспределению = ДанныеЗаполнения.СуммаДокумента - Товары.Итог("Сумма");
				Если НЕ СуммаКРаспределению = 0 Тогда
					Товары[НомерСтрокиПоследнегоПотолка-1].Сумма = Товары[НомерСтрокиПоследнегоПотолка-1].Сумма + СуммаКРаспределению;
					Если НЕ Товары[НомерСтрокиПоследнегоПотолка-1].Количество = 0 Тогда
						Товары[НомерСтрокиПоследнегоПотолка-1].Цена = Товары[НомерСтрокиПоследнегоПотолка-1].Сумма / Товары[НомерСтрокиПоследнегоПотолка-1].Количество;
					Иначе
						Товары[НомерСтрокиПоследнегоПотолка-1].Цена = Товары[НомерСтрокиПоследнегоПотолка-1].Сумма;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НомерСтрокиПоследнегоПотолка = 0 Тогда
			Товары.Очистить();
			Услуги.Очистить();
			ЗаполнитьТаблицыТоваровИУслугПоОснованию(ДанныеЗаполнения.Товары, ДанныеЗаполнения.Услуги, ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуСУчетомДоставки(ТекущаяСтрока) Экспорт
	
	СуммаСебестоимостиСУчетомДоставки = ТекущаяСтрока.Сумма;
	Если СтоимостьДоставки <> 0 Тогда
		Если ПорядокРаспределенияСтоимостиДоставки = 0 Тогда  //По доле стоимости позиции в общей сумме документа
			Если НЕ Товары.Итог("Сумма") = 0 Тогда
				СуммаСебестоимостиСУчетомДоставки = СуммаСебестоимостиСУчетомДоставки + Окр(СтоимостьДоставки * ТекущаяСтрока.Сумма / Товары.Итог("Сумма"), 2);
			Иначе
				СуммаСебестоимостиСУчетомДоставки = СуммаСебестоимостиСУчетомДоставки + Окр(СтоимостьДоставки / Товары.Количество(), 2);
			КонецЕсли;
			
		ИначеЕсли ПорядокРаспределенияСтоимостиДоставки = 1 Тогда  //Попозиционно в равных долях
			СуммаСебестоимостиСУчетомДоставки = СуммаСебестоимостиСУчетомДоставки + Окр(СтоимостьДоставки / Товары.Количество(), 2);
			
		ИначеЕсли ПорядокРаспределенияСтоимостиДоставки = 2 Тогда  //По доле стоимости позиции в общей сумме документа
			Если НЕ Товары.Итог("Количество") = 0 Тогда
				СуммаСебестоимостиСУчетомДоставки = СуммаСебестоимостиСУчетомДоставки + Окр(СтоимостьДоставки * ТекущаяСтрока.Количество / Товары.Итог("Количество"), 2);
			Иначе
				СуммаСебестоимостиСУчетомДоставки = СуммаСебестоимостиСУчетомДоставки + Окр(СтоимостьДоставки / Товары.Количество(), 2);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат СуммаСебестоимостиСУчетомДоставки;
	
КонецФункции
		
#КонецОбласти

#КонецЕсли
